-- =============================================
-- Проектируем схему базы данных для хранения задач
-- Необходимые поля:
-- первичный ключ в таблице,
-- идентификатор чата, в который нужно отправить уведомление,
-- текст уведомления,
-- дата + время, когда требуется отправить уведомление.
-- =============================================

-- liquibase formatted sql

-- changeset Kate:1
CREATE TABLE Task (
id SERIAL PRIMARY KEY,
chatId BIGINT NOT NULL,
message TEXT NOT NULL,
dateAndTime TIMESTAMP NOT NULL
)